---
kind: other
id: Properties.T:Autodesk.Revit.DB.SymbolicCurveArrayIterator
source: html/2d08fe83-9e30-3b58-182e-67e7e79898d0.htm
---
# SymbolicCurveArrayIterator Properties

Retrieves the item that is the current focus of the iterator.